Repository: v-dobr/LQA_DEC2016
Catalog: */20161003_auth_overview.xlf
Languages: pt_br

source: App authentication with Microsoft Graph
pt_br: Autenticação de aplicativo com o Microsoft Graph

source: To access a user's Microsoft data, your application must enable users to authenticate their identity and give their consent for the app to perform actions on their behalf.
pt_br: Para acessar dados da Microsoft do usuário, seu aplicativo deve permitir que os usuários autentiquem a identidade deles e deem consentimento para o aplicativo executar ações no nome deles.

source: The Microsoft Graph supports two authentication providers:
pt_br: O Microsoft Graph é compatível com dois provedores de autenticação:

source: To authenticate users with personal Microsoft accounts, such as _live.com_ or _outlook.com_ accounts, use the [Azure Active Directory (Azure AD) v2.0 endpoint](converged_auth).
pt_br: Para autenticar os usuários com as contas pessoais da Microsoft, como contas do _live.com_ ou _outlook.com_, use o [ponto de extremidade do Azure Active Directory (Azure AD) v2.0](converged_auth).

source: To authenticate users with enterprise (that is, work or school) accounts, use [Azure AD](app_authorization).
pt_br: Para autenticar os usuários com contas de empresa (ou seja, corporativas ou de estudante), use o [Azure AD](app_authorization).

# p101
source: **Building apps for enterprise customers?** Your app might not work if your enterprise customer turns on enterprise mobility security features like <a href="https://azure.microsoft.com/en-us/documentation/articles/active-directory-conditional-access-device-policies/" target="_newtab">conditional device access</a>.
pt_br: **Criando aplicativos para clientes corporativos?** O aplicativo pode não funcionar caso o cliente corporativo habilite os recursos Enterprise Mobility + Security, como <a href="https://azure.microsoft.com/en-us/documentation/articles/active-directory-conditional-access-device-policies/" target="_newtab">acesso condicional ao dispositivo</a>.

source: To support **all enterprise customers** across **all enterprise scenarios**, you must use the Azure AD endpoint and use the [Azure Management Portal](https://aka.ms/aadapplist) to manage your apps.
pt_br: Para fornecer suporte a **todos os clientes corporativos**, em **todos os cenários corporativos**, use o ponto de extremidade do Microsoft Azure AD e use o [Portal de Gerenciamento do Microsoft Azure](https://aka.ms/aadapplist) para gerenciar os aplicativos.

source: Microsoft Graph application stack, with authentication shown as a layer between your app and the various Microsoft Graph resources.
pt_br: Pilha de aplicativos do Microsoft Graph com a autenticação mostrada como uma camada entre seu aplicativo e os diversos recursos do Microsoft Graph.

source: Deciding between the Azure AD and Azure AD v2.0 endpoints
pt_br: Decidindo entre os pontos de extremidade do Azure AD e do Azure AD v2.0

# p102
source: The following table summarizes the major features that the Azure AD and Azure AD v2.0 endpoints support, and provides links to additional information. The relative importance of these features--and therefore, which authentication provider you choose to implement in your app--will primarily depend on:
pt_br: A tabela a seguir resume os principais recursos compatíveis com os pontos de extremidade do Azure AD e do Azure AD v2.0, e fornece links para informações adicionais. A importância relativa desses recursos e, portanto, qual provedor de autenticação você escolher implementar em seu aplicativo, dependerão principalmente destes fatores:

source: The account type (enterprise or consumer) your apps needs to support
pt_br: O tipo da conta (corporativo ou consumidor) compatível com seus aplicativos

source: The type of app you want to build
pt_br: O tipo de aplicativo que você deseja criar

source: The authentication flow required
pt_br: O fluxo de autenticação obrigatório

source: Azure AD endpoint
pt_br: Ponto de extremidade do Azure AD

source: Azure AD v2.0 endpoint
pt_br: Ponto de extremidade do Azure AD v2.0

source: Grant types supported
pt_br: Tipos de concessão compatíveis

source: Authorization code
pt_br: Código de autorização

source: Implicit
pt_br: Implícito

source: Client credentials
pt_br: Credenciais do cliente

source: Resource owner password credentials
pt_br: Credenciais de senha de proprietário do recurso

source: Authorization code
pt_br: Código de autorização

source: Implicit
pt_br: Implícito

source: Client credentials
pt_br: Credenciais do cliente

source: App types supported
pt_br: Tipos de aplicativo compatíveis

source: Web apps
pt_br: Aplicativos Web

source: Web APIs
pt_br: APIs da Web

source: Mobile and native apps
pt_br: Aplicativos móveis e nativos

source: Single Page App (SPA)
pt_br: Aplicativo de página única (SPA)

source: Standalone Web APIs
pt_br: APIs da Web autônomas

source: Daemons/Server Side Apps
pt_br: Daemons e aplicativos do lado do servidor

source: more information
pt_br: mais informações

source: Web apps
pt_br: Aplicativos Web

source: Web APIs
pt_br: APIs da Web

source: Mobile and native apps
pt_br: Aplicativos móveis e nativos

source: Single Page App (SPA)
pt_br: Aplicativo de página única (SPA)

source: Daemons/Server Side Apps
pt_br: Daemons e aplicativos do lado do servidor

source: more information
pt_br: mais informações

source: Conditional access device policies
pt_br: Políticas de dispositivo de acesso condicional

source: Supported
pt_br: Com suporte

source: Not currently supported
pt_br: Não há suporte atualmente

source: OAuth 2.0 and OpenID Connect compliant
pt_br: Compatíveis com OAuth 2.0 e OpenID Connect

source: No
pt_br: Não

source: Yes
pt_br: Sim

source: Permissions
pt_br: Permissões

source: Static: Specified during app registration
pt_br: Estático: Especificado durante o registro do aplicativo

source: Dynamic:</a> Request during app runtime; includes incremental consent
pt_br: Dinâmico:</a> Solicitar durante o tempo de execução do aplicativo; inclui consentimento incremental

source: Account types
pt_br: Tipos de conta

source: work or school
pt_br: corporativa ou de estudante

source: work or school
pt_br: corporativa ou de estudante

source: personal
pt_br: pessoal

source: App ID
pt_br: ID do aplicativo

source: Separate app ID for each platform
pt_br: ID do aplicativo separado para cada plataforma

source: Single app ID for multiple platforms
pt_br: ID do aplicativo único para várias plataformas

source: Registration portal
pt_br: Portal de registro

source: Microsoft Azure Management
pt_br: Gerenciamento do Microsoft Azure

source: Microsoft Application Registration
pt_br: Registro de aplicativo da Microsoft

source: Client libraries
pt_br: Bibliotecas de cliente

source: Active Directory Authentication (ADAL) SDKs for most development platforms
pt_br: SDKs de Autenticação do Active Directory (ADAL) para a maioria das plataformas de desenvolvimento

source: Microsoft Authentication Library (Preview)
pt_br: Biblioteca de Autenticação da Microsoft (visualização)

source: Open source OAuth 2.0 libraries (list)
pt_br: Bibliotecas OAuth 2.0 de código aberto (lista)

source: Other features
pt_br: Outros recursos

source: Group claims for Azure AD users
pt_br: Declarações de grupo para usuários do Azure AD

source: Application Roles and Role Claims
pt_br: Funções do aplicativo e declarações de função

# p103
source: In addition, there are differences in permission scopes required by the two authentication providers, as well as differences in the claims returned in various tokens. For more information, see [Well-known scopes](https://azure.microsoft.com/en-us/documentation/articles/active-directory-v2-compare/#well-known-scopes) and [Token Claims](https://azure.microsoft.com/en-us/documentation/articles/active-directory-v2-compare/#token-claims) in [What's different about the v2.0 endpoint?](https://azure.microsoft.com/en-us/documentation/articles/active-directory-v2-compare/).
pt_br: Além disso, existem diferenças em escopos de permissão exigidas pelos dois provedores de autenticação, além de diferenças nas declarações retornadas em vários tokens. Para mais informações, confira [Escopos conhecidos](https://azure.microsoft.com/en-us/documentation/articles/active-directory-v2-compare/#well-known-scopes) e [Declarações do token](https://azure.microsoft.com/en-us/documentation/articles/active-directory-v2-compare/#token-claims) em [Qual é a diferença do ponto de extremidade v2.0?](https://azure.microsoft.com/en-us/documentation/articles/active-directory-v2-compare/).

# p104
source: Also, the Azure AD v2.0 endpoint is under active development, with additional features and supported scenarios to be added. For a current list of limitations and restrictions for the Azure AD v2.0 endpoint, see [Should I use the v2.0 endpoint?](https://azure.microsoft.com/en-us/documentation/articles/active-directory-v2-limitations/).
pt_br: Além disso, o ponto de extremidade do Azure AD v2.0 está em desenvolvimento ativo. Serão adicionados mais recursos e cenários compatíveis. Para obter uma lista atual de limitações e restrições para o ponto de extremidade do Azure AD v2.0, confira [Devo usar o ponto de extremidade v2.0?](https://azure.microsoft.com/en-us/documentation/articles/active-directory-v2-limitations/).

source: Registering your app for authentication
pt_br: Registrando seu aplicativo para autenticação

# p105
source: When you decide which authentication provider meets your app's requirements, you need to register your app at that authentication provider's portal. Registering your app establishes your app's identity with the authentication provider, and enables your app to specify its identity when submitting authentication requests from the user.
pt_br: Quando você decide qual provedor de autenticação atende aos requisitos do seu aplicativo, precisa registrar seu aplicativo no portal do provedor de autenticação. Registrar seu aplicativo estabelece a identidade do seu aplicativo com o provedor de autenticação e permite que ele especifique a própria identidade ao enviar solicitações de autenticação do usuário.

source: To register your app with Azure AD, use the [Azure portal](https://portal.azure.com/).
pt_br: Para registrar seu aplicativo com o Azure AD, use o [Portal do Azure](https://portal.azure.com/).

source: To [register your app with the Azure AD v2.0 endpoint](auth_register_app_v2.md), use the [Microsoft Application Registration portal](https://apps.dev.microsoft.com).
pt_br: Para [registrar seu aplicativo com o ponto de extremidade do Azure AD v2.0](auth_register_app_v2.md), use o [Portal de registro do aplicativo da Microsoft](https://apps.dev.microsoft.com).

source: Resources for implementing authentication in your Microsoft Graph app
pt_br: Recursos para implementar a autenticação em seu aplicativo Microsoft Graph

source: After you register your app with the appropriate authentication portal, and have the app registration information (app ID, app secret, if applicable, and redirect URI) that you need to establish your app's identity, you're ready to implement authentication in your app.
pt_br: Depois que você registrar seu aplicativo com o portal de autenticação apropriado e tiver as informações de registro do aplicativo (ID do aplicativo, segredo do aplicativo, se aplicável, e o URI de redirecionamento) de que você precisa para estabelecer a identidade do seu aplicativo, estará pronto para implementar a autenticação em seu aplicativo.

source: Again, this will vary depending on the type of app you're building, your development platform, the authentication flow you choose, and any specific authentication requirements for your app.
pt_br: Novamente, isso variará dependendo do tipo de aplicativo que você está criando, sua plataforma de desenvolvimento, o fluxo de autenticação que você escolher e os outros requisitos de autenticação específicos do aplicativo.

source: Connect samples by authentication provider and platform
pt_br: Exemplos de conexão por provedor e plataforma de autenticação

source: The following table lists the Connect samples by authentication provider and platform, and notes whether they connect to Microsoft Graph using REST or a Microsoft Graph client library.
pt_br: A tabela a seguir lista os exemplos de conexão por provedor e plataforma de autenticação e observações se eles se conectaram ao Microsoft Graph usando REST ou uma biblioteca de cliente do Microsoft Graph.

source: Platform
pt_br: Plataforma

source: Azure AD endpoint
pt_br: Ponto de extremidade do Azure AD

source: Azure AD v2.0 endpoint
pt_br: Ponto de extremidade do Azure AD v2.0

source: <a href="https://github.com/microsoftgraph/android-java-connect-rest-sample">REST sample</a> or <a href="https://github.com/microsoftgraph/android-java-connect-sample/tree/last_v1_auth">SDK sample</a>
pt_br: <a href="https://github.com/microsoftgraph/android-java-connect-rest-sample">Exemplo de REST</a> ou <a href="https://github.com/microsoftgraph/android-java-connect-sample/tree/last_v1_auth">exemplo de SDK</a>

source: <a href="https://github.com/microsoftgraph/android-java-connect-sample">SDK sample</a>
pt_br: <a href="https://github.com/microsoftgraph/android-java-connect-sample">Exemplo de SDK</a>

source: <a href="https://github.com/microsoftgraph/aspnet-connect-rest-sample">REST sample</a>
pt_br: <a href="https://github.com/microsoftgraph/aspnet-connect-rest-sample">Exemplo de REST</a>

source: <a href="https://github.com/microsoftgraph/aspnet-connect-sample">SDK sample</a>
pt_br: <a href="https://github.com/microsoftgraph/aspnet-connect-sample">Exemplo de SDK</a>

source: <a href="https://github.com/microsoftgraph/ios-objectivec-connect-rest-sample">REST sample</a>
pt_br: <a href="https://github.com/microsoftgraph/ios-objectivec-connect-rest-sample">Exemplo de REST</a>

source: <a href="https://github.com/microsoftgraph/ios-objectivec-connect-sample">SDK sample</a>
pt_br: <a href="https://github.com/microsoftgraph/ios-objectivec-connect-sample">Exemplo de SDK</a>

source: <a href="https://github.com/microsoftgraph/ios-swift-connect-rest-sample">REST sample</a>
pt_br: <a href="https://github.com/microsoftgraph/ios-swift-connect-rest-sample">Exemplo de REST</a>

source: <a href="https://github.com/microsoftgraph/ios-swift-connect-sample">SDK sample</a>
pt_br: <a href="https://github.com/microsoftgraph/ios-swift-connect-sample">Exemplo de SDK</a>

source: <a href="https://github.com/microsoftgraph/nodejs-connect-rest-sample/tree/last_v1_auth">REST sample</a>
pt_br: <a href="https://github.com/microsoftgraph/nodejs-connect-rest-sample/tree/last_v1_auth">Exemplo de REST</a>

source: <a href="https://github.com/microsoftgraph/nodejs-connect-rest-sample">REST sample</a>
pt_br: <a href="https://github.com/microsoftgraph/nodejs-connect-rest-sample">Exemplo de REST</a>

source: <a href="https://github.com/microsoftgraph/php-connect-rest-sample/tree/last_v1_auth">REST sample</a>
pt_br: <a href="https://github.com/microsoftgraph/php-connect-rest-sample/tree/last_v1_auth">Exemplo de REST</a>

source: <a href="https://github.com/microsoftgraph/php-connect-rest-sample">REST sample</a>
pt_br: <a href="https://github.com/microsoftgraph/php-connect-rest-sample">Exemplo de REST</a>

source: <a href="https://github.com/microsoftgraph/python3-connect-rest-sample">REST sample</a>
pt_br: <a href="https://github.com/microsoftgraph/python3-connect-rest-sample">Exemplo de REST</a>

source: <a href="https://github.com/microsoftgraph/ruby-connect-rest-sample/tree/last_v1_auth">REST sample</a>
pt_br: <a href="https://github.com/microsoftgraph/ruby-connect-rest-sample/tree/last_v1_auth">Exemplo de REST</a>

source: <a href="https://github.com/microsoftgraph/ruby-connect-rest-sample">REST sample</a>
pt_br: <a href="https://github.com/microsoftgraph/ruby-connect-rest-sample">Exemplo de REST</a>

source: <a href="https://github.com/microsoftgraph/uwp-csharp-connect-rest-sample/tree/last_v1_auth">REST sample</a>
pt_br: <a href="https://github.com/microsoftgraph/uwp-csharp-connect-rest-sample/tree/last_v1_auth">Exemplo de REST</a>

source: <a href="https://github.com/microsoftgraph/uwp-csharp-connect-rest-sample">REST sample</a> or <a href="https://github.com/microsoftgraph/uwp-csharp-connect-sample">SDK sample</a>
pt_br: <a href="https://github.com/microsoftgraph/uwp-csharp-connect-rest-sample">Exemplo de REST</a> ou <a href="https://github.com/microsoftgraph/uwp-csharp-connect-sample">exemplo de SDK</a>

source: <a href="https://github.com/microsoftgraph/xamarin-csharp-connect-sample">SDK sample</a>
pt_br: <a href="https://github.com/microsoftgraph/xamarin-csharp-connect-sample">Exemplo de SDK</a>

source: To explore a wide range of projects that connect to Microsoft Graph over a broad assortment of technologies, visit the [Microsoft Graph repo](https://github.com/microsoftgraph) on GitHub.
pt_br: Para explorar uma ampla variedade de projetos que se conectam ao Microsoft Graph por meio de uma ampla variedade de tecnologias, visite o [repositório do Microsoft Graph](https://github.com/microsoftgraph) no GitHub.

source: Get Started
pt_br: Introdução

source: The [Get Started](http://graph.microsoft.io/en-us/docs/platform/get-started) section contains detailed articles that show you how to create the apps listed in the table using the Azure AD v2.0 endpoint, and covers the authentication libraries used on each platform.
pt_br: A seção [Introdução](http://graph.microsoft.io/en-us/docs/platform/get-started) contém artigos detalhados que mostram como criar os aplicativos listados na tabela usando o ponto de extremidade do Azure AD v2.0 e aborda as bibliotecas de autenticação usadas em cada plataforma.

source: See also
pt_br: Ver também

source: <a href="https://azure.microsoft.com/en-us/documentation/articles/active-directory-authentication-scenarios/#basics-of-authentication-in-azure-ad" target="_newtab">Authentication Scenarios for Azure AD</a>
pt_br: <a href="https://azure.microsoft.com/en-us/documentation/articles/active-directory-authentication-scenarios/#basics-of-authentication-in-azure-ad" target="_newtab">Cenários de autenticação para Azure AD</a>

source: <a href="https://azure.microsoft.com/en-us/documentation/articles/?product=active-directory&term=v2.0+endpoint" target="_newtab">Azure AD v2.0 endpoint documentation on Azure.com</a>
pt_br: <a href="https://azure.microsoft.com/en-us/documentation/articles/?product=active-directory&term=v2.0+endpoint" target="_newtab">Documentação do ponto de extremidade do Azure AD v2.0 no Azure.com</a>

source: <a href="https://azure.microsoft.com/en-us/documentation/articles/active-directory-v2-app-registration/#build-a-quick-start-app" target="_newtab">Azure AD v2.0 code quick starts on Azure.com</a>
pt_br: <a href="https://azure.microsoft.com/en-us/documentation/articles/active-directory-v2-app-registration/#build-a-quick-start-app" target="_newtab">Inícios rápidos do código do Azure AD v2.0 no Azure.com</a>
