Repository: v-dobr/LQA_DEC2016
Catalog: */onedrive.xlf
Languages: de_de, fr_fr

source: Working with files in Microsoft Graph
de_de: Arbeiten mit Dateien in Microsoft Graph
fr_fr: Utiliser des fichiers dans Microsoft Graph

# p101
source: You can use Microsoft Graph to create an app that connects with files across OneDrive, OneDrive for Business, and SharePoint document libraries. With Microsoft Graph, you can build a variety of experiences with files stored in Office 365, from simply storing user documents to complex file sharing scenarios.
de_de: Mithilfe von Microsoft Graph können Sie eine App erstellen, die eine Verbindung mit Dateien in OneDrive-, OneDrive for Business- und SharePoint-Dokumentbibliotheken herstellt. Mit Microsoft Graph können Sie verschiedene Möglichkeiten zum Umgang mit in Office 365 gespeicherten Dateien einrichten, angefangen vom einfachen Speichern von Dokumenten bis hin zu komplexen Dateifreigabeszenarien.
fr_fr: Vous pouvez utiliser Microsoft Graph pour créer une application qui accède aux fichiers dans les bibliothèques de documents OneDrive, OneDrive Entreprise et SharePoint. Avec Microsoft Graph, vous pouvez créer différentes expériences avec des fichiers stockés dans Office 365, en stockant simplement les documents des utilisateurs ou en partageant des fichiers complexes.

source: Microsoft Graph exposes two resource types for working with files:
de_de: Microsoft Graph legt zwei Ressourcentypen für die Arbeit mit Dateien Offen:
fr_fr: Microsoft Graph propose deux types de ressources pour l’utilisation des fichiers :

source: [Drive](drive.md) - Represents a logical container of files, like a document library or a user's OneDrive.
de_de: [Drive](drive.md): Stellt einen logischen Container von Dateien wie z. B. eine Dokumentbibliothek oder OneDrive eines Benutzers dar.
fr_fr: [Drive](drive.md) : représente un conteneur logique de fichiers, tel qu’une bibliothèque de documents ou le lecteur OneDrive d’un utilisateur.

source: [DriveItem](driveitem.md) - Represents an item within a drive, like a document, photo, video, or folder.
de_de: [DriveItem](driveitem.md): Stellt ein Element innerhalb eines Laufwerks dar, wie z. B. ein Dokument, ein Foto, ein Video oder einen Ordner.
fr_fr: [DriveItem](driveitem.md) : représente un élément présent sur un lecteur, comme un document, une photo, une vidéo ou un dossier.

# p102
source: Most of the interaction with files occurs through interaction with **DriveItem** resources. The following is an example of a DriveItem resource:
de_de: Die meisten Interaktionen mit Dateien finden über Interaktionen mit **DriveItem**-Ressourcen statt. Es folgt ein Beispiel für eine DriveItem-Ressource:
fr_fr: La plupart des interactions avec les fichiers s’effectue en interagissant avec des ressources **DriveItem**. Voici un exemple d’une ressource DriveItem :

source: **Drive** and **DriveItem** resources expose data in three different ways:
de_de: **Drive**- und **DriveItem**-Ressourcen legen Daten auf drei verschiedene Arten offen:
fr_fr: Les ressources **Drive** et **DriveItem** affichent les données de trois manières différentes :

source: _Properties_ (like **id** and **name**) expose simple values (strings, numbers, Booleans).
de_de: _Eigenschaften_ (wie **id** und **name**) legen einfache Werte (Zeichenfolgen, Zahlen, boolesche Werte) offen.
fr_fr: Les _Propriétés_ (comme **id** et **nom**) exposent des valeurs simples (chaînes, nombres, valeurs booléennes).

# p103
source: _Facets_ (like **file** and **photo**) expose complex values. The presence of **file** or **folder** facets indicates behaviors and properties of a **DriveItem**.
de_de: _Facets_ (wie **file** und **photo**) legen komplexe Werte offen. Vorhandene **file**- oder **folder**-Facets geben Verhaltensweisen und Eigenschaften eines **DriveItem** an.
fr_fr: Les _Facettes_ (comme **fichier** et **photo**) exposent des valeurs complexes. La présence de facettes **fichier** ou **dossier** indique les comportements et les propriétés d’un objet **DriveItem**.

source: _References_ (like **children** and **thumbnails**) point to collections of other resources.
de_de: _Referenzen_ (wie **children** und **thumbnails**) verweisen auf Sammlungen anderer Ressourcen.
fr_fr: Les _Références_ (comme **enfants** et **miniatures**) renvoient aux collections d’autres ressources.

source: Commonly accessed resources
de_de: Häufig verwendete Ressourcen
fr_fr: Ressources fréquemment employées

source: Most API requests for file interactions will use one of these base resources to access a **Drive** or **DriveItem**.
de_de: Die meisten API-Anforderungen für Dateiinteraktionen verwenden eine der folgenden grundlegenden Ressourcen für den Zugriff auf **Drive** oder **DriveItem**.
fr_fr: La plupart des requêtes d’API qui demandent des interactions entre les fichiers utilisent l’une de ces ressources de base pour accéder à un objet **Drive** ou **DriveItem**.

source: Path
de_de: Pfad
fr_fr: Chemin

source: Resource
de_de: Ressource
fr_fr: Ressource

source: User's OneDrive
de_de: OneDrive eines Benutzers
fr_fr: Lecteur OneDrive d’un utilisateur

source: Enumerate OneDrive resources available to the user.
de_de: Listet die für den Benutzer verfügbaren OneDrive-Ressourcen auf.
fr_fr: Énumère les ressources OneDrive mises à la disposition de l’utilisateur.

source: Access a specific **Drive** by the drive's ID.
de_de: Greift auf ein bestimmtes **Drive** über die Laufwerks-ID zu.
fr_fr: Accède à un objet **Drive** spécifique via l’ID du lecteur.

source: Enumerate the **DriveItem** resources in the root of a specific **Drive**.
de_de: Listet die **DriveItem**-Ressourcen in der Root eines spezifischen **Drive** auf.
fr_fr: Énumère les ressources **DriveItem** de la racine d’un objet **Drive** spécifique.

source: Access a **DriveItem** in the user's OneDrive by its unique ID.
de_de: Greift auf ein **DriveItem** auf dem OneDrive des Benutzers über die eindeutige ID zu.
fr_fr: Accède à un objet **DriveItem** dans le lecteur OneDrive de l’utilisateur via son ID unique.

source: Access a special (named) folder in the user's OneDrive by its known name.
de_de: Greift auf einen bestimmten (benannten) Ordner auf dem OneDrive des Benutzers über seinen bekannten Namen zu.
fr_fr: Accède à un dossier spécial (nommé) dans le lecteur OneDrive de l’utilisateur via son nom connu.

source: Access another user's OneDrive by using the user's unique ID.
de_de: Greift auf das OneDrive eines anderen Benutzers mithilfe der eindeutigen ID des Benutzers zu.
fr_fr: Accède au lecteur OneDrive d’un autre utilisateur via l’ID unique de l’utilisateur.

source: Access the default document library for a group by the group's unique ID.
de_de: Greift auf die Standarddokumentbibliothek für eine Gruppe mithilfe der eindeutigen ID der Gruppe zu.
fr_fr: Accède à la bibliothèque de documents par défaut d’un groupe via l’ID unique du groupe.

source: Access a **DriveItem** by its **sharedId** or sharing URL.
de_de: Greift auf ein **DriveItem** über seine **SharedId** oder eine Freigabe-URL zu.
fr_fr: Accède à un objet **DriveItem** via son ID partagé (**sharedId**) ou son URL de partage.

# p104
source: In addition to addressing a **DriveItem** within a **Drive** by unique ID, your app can also address a **DriveItem** by relative path from a known resource. To address using a path, the colon (`:`) character is used to escape the relative path. This table provides an example of different ways to use the colon character to address an item by path.
de_de: Zusätzlich zur Adressierung eines **DriveItem** innerhalb eines **Drive** durch eine eindeutige ID kann die App ein **DriveItem** auch über einen relativen Pfad von einer bekannten Ressource adressieren. Zur Adressierung über einen Pfad wird das Doppelpunktzeichen (`:`) für das Escape des relativen Pfads verwendet. Diese Tabelle enthält ein Beispiel für unterschiedliche Methoden für die Verwendung des Doppelpunkts zur Adressierung eines Elements nach Pfad.
fr_fr: En plus d’utiliser l’ID unique de l’objet **DriveItem** pour y accéder dans l’objet **Drive**, votre application peut également accéder à l’objet **DriveItem** via son chemin d’accès relatif à partir d’une ressource connue. Pour utiliser un chemin d’accès, le signe deux-points (`:`) permet d’ignorer le chemin d’accès relatif. Ce tableau fournit un exemple qui montre comment utiliser le caractère deux-points pour accéder à un élément via son chemin d’accès.

source: Path
de_de: Pfad
fr_fr: Chemin

source: Resource
de_de: Ressource
fr_fr: Ressource

source: Access a **DriveItem** by path relative to the user's OneDrive root folder.
de_de: Greift auf ein **DriveItem** über den Pfad relativ zum OneDrive-Stammordner des Benutzers zu.
fr_fr: Accède à un objet **DriveItem** via le chemin d’accès au dossier racine du lecteur OneDrive de l’utilisateur.

source: Access a **DriveItem** by path relative to another item (a **DriveItem** with a **folder** facet).
de_de: Greift auf ein **DriveItem** über einen Pfad relativ zu einem anderen Element zu (einem **DriveItem** mit einem **folder**-Facet).
fr_fr: Accède à un objet **DriveItem** via le chemin d’accès relatif à un autre élément (un objet **DriveItem** avec une facette **dossier**).

source: List the children of a **DriveItem** by path relative to the root of the user's OneDrive.
de_de: Listet die untergeordneten Elemente eines **DriveItem** über einen Pfad relativ zum Stammordner des OneDrive des Benutzers auf.
fr_fr: Répertorie les enfants d’un objet **DriveItem** via le chemin d’accès relatif à la racine du lecteur OneDrive de l’utilisateur.

source: List the children of a **DriveItem** by path relative to another item.
de_de: Listet die untergeordneten Elemente eines **DriveItem** über einen Pfad relativ zu einem anderen Element auf.
fr_fr: Répertorie les enfants d’un objet **DriveItem** via le chemin d’accès relatif à un autre élément.

source: Drive resource
de_de: Drive-Ressource
fr_fr: Ressource Drive

# p105
source: The [Drive resource](drive.md) is the top-level object within a user's OneDrive or a SharePoint document library. Nearly all files operations will start by addressing a specific drive resource.
de_de: Die [Drive-Ressource](drive.md) ist das Objekt der obersten Ebene innerhalb des OneDrive eines Benutzers oder einer SharePoint-Dokumentbibliothek. Fast alle Dateivorgänge beginnen damit, dass eine bestimmte Drive-Ressource adressiert wird.
fr_fr: La [ressource Drive](drive.md) est l’objet de niveau supérieur présent dans le lecteur OneDrive d’un utilisateur ou dans une bibliothèque de documents SharePoint. Presque toutes les opérations de fichiers commencent par accéder à une ressource spécifique du lecteur.

source: A drive resource can be addressed either by the drive's unique ID or by the default drive for a [User](user.md), [Group](group.md), or organization.
de_de: Eine Drive-Ressource kann entweder von der eindeutigen ID des Laufwerks oder von dem Standardlaufwerk eines [Benutzers](user.md), einer [Gruppe](group.md), oder einer Organisation adressiert werden.
fr_fr: Une ressource de lecteur peut être accessible via l’ID unique du lecteur ou via le lecteur par défaut d’un [utilisateur](user.md), d’un [groupe](group.md) ou d’une organisation.

source: DriveItem resource
de_de: DriveItem-Ressource
fr_fr: Ressource DriveItem

# p106
source: [DriveItems](driveitem.md) are the objects inside a drive's file system. They can be accessed by their **id** by using `/items/{item-id}` syntax, or by their file system path using the `/root:/path/to/item/` syntax.
de_de: [DriveItems](driveitem.md) sind die Objekte innerhalb des Laufwerks-Dateisystems. Der Zugriff darauf erfolgt über ihre **id** unter Verwendung der `/items/{item-id}`-Syntax oder den Dateisystempfad unter Verwendung der`/root:/path/to/item/`-Syntax.
fr_fr: Les objets [DriveItem](driveitem.md) sont les objets présents dans le système de fichiers d’un lecteur. Ils sont accessibles via leur **ID** à l’aide de la syntaxe `/items/{item-id}`, ou via le chemin d’accès du système de fichiers à l’aide de la syntaxe `/root:/path/to/item/`.

source: DriveItems have _facets_ that provide data about the item's identity and capabilities.
de_de: DriveItems verfügen _Facets_, die Daten zu den Identitäten und Funktionen der Elemente bereitstellen.
fr_fr: Les objets DriveItem ont des _facettes_ qui fournissent des informations sur l’identité de l’élément et ses fonctions.

source: DriveItems with a **folder** facet act as containers of items, and have a **children** reference, which points to a collection of items under the folder.
de_de: DriveItems mit einem **folder**-Facet fungieren als Container von Elementen und enthalten einen **children**-Verweis, der auf eine Sammlung von Elementen unter dem Ordner zeigt.
fr_fr: Les objets DriveItem avec une facette **dossier** servent de conteneurs d’éléments et ont une référence **enfants**, qui renvoie à une collection d’éléments situés au-dessous du dossier.

source: Shared folders and remote items
de_de: Freigegebene Ordner und Remoteelemente
fr_fr: Dossiers partagés et éléments distants

# p107
source: OneDrive personal users can add one or more shared items from another drive to their own OneDrive. These shared items appear as a **DriveItem** in the **children** collection with a [remoteItem](remoteitem.md) facet.
de_de: Persönliche OneDrive-Benutzer können ein oder mehrere freigegebene Elemente von einem anderen Laufwerk zu ihrem eigenen OneDrive hinzufügen. Diese freigegebenen Elemente werden als **DriveItem** in der **children**-Sammlung mit einem [remoteItem](remoteitem.md)-Facet angezeigt.
fr_fr: Les utilisateurs personnels OneDrive peuvent ajouter à leur propre lecteur OneDrive un ou plusieurs éléments partagés à partir d’un autre lecteur. Ces éléments partagés apparaissent comme un objet **DriveItem** dans la collection d’objets **enfants** ayant une facette [remoteItem](remoteitem.md).

source: For more information about working with shared folders and remote items, see [Remote items and shared folders](remoteitem.md).
de_de: Weitere Informationen zum Arbeiten mit freigegebenen Ordnern und Remoteelementen finden Sie unter [Remoteelemente und freigegebene Ordner](remoteitem.md).
fr_fr: Pour plus d’informations sur l’utilisation des dossiers partagés et des éléments distants, consultez la rubrique relative aux [éléments distants et dossiers partagés](remoteitem.md).

source: Sharing and permissions
de_de: Freigabe und Berechtigungen
fr_fr: Partage et autorisations

# p108
source: One of the most common actions for OneDrive and SharePoint document libraries is sharing content with other people. Microsoft Graph allows your app to create [sharing links](../api/item_createLink.md), [add permissions and send invitations](../api/item_invite.md) to items in a drive.
de_de: Eine der am häufigsten verwendeten Aktionen für OneDrive und SharePoint-Dokumentbibliotheken besteht im Freigeben von Inhalten für andere Personen. Über Microsoft Graph kann Ihre App [Freigabelinks](../api/item_createLink.md) erstellen, [Genehmigungen hinzufügen und Einladungen an Elemente eines Laufwerks senden](../api/item_invite.md).
fr_fr: L’une des actions les plus courantes des bibliothèques de documents OneDrive et SharePoint consiste à partager du contenu avec d’autres personnes. Microsoft Graph permet à votre application de créer des [liens de partage](../api/item_createLink.md), d’[ajouter des autorisations et d’envoyer des invitations](../api/item_invite.md) à des éléments d’un lecteur.

source: Microsoft Graph also provides a way for your app to [access shared content](../api/shares_get.md) directly from a sharing link.
de_de: Microsoft Graph bietet der App auch eine Möglichkeit, [Zugriff auf freigegebene Inhalte](../api/shares_get.md) direkt über einen Freigabelinks zu erhalten.
fr_fr: Microsoft Graph permet également à votre application d’[accéder au contenu partagé](../api/shares_get.md) directement à partir d’un lien de partage.
